 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
УникальныеЗаписи = Новый Соответствие();
Для Каждого ТекСтрока Из ПозицииЛекарств Цикл
		Если УникальныеЗаписи.Получить(ТекСтрока.Лекарство) <> Неопределено Тогда
		Отказ = Истина;
		Сообщить("Лекарство '" + ТекСтрока.Лекарство + "' уже существует в документе.");
	Прервать;
	КонецЕсли;
		УникальныеЗаписи.Вставить(ТекСтрока.Лекарство, Истина);
	КонецЦикла;


	Если ЭтотОбъект.ПозицииЛекарств.Количество() = 0 Тогда
	Отказ = Истина;
	Сообщить("Запись не может быть пустой.");
Возврат;
КонецЕсли;
КонецПроцедуры
