// Модуль объекта документа ПартииЛекарств

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Для Каждого СтрокаПартии Из ЭтотОбъект.СоставПартии Цикл
        Движение = Движения.ОстаткиНаСкладе.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = ЭтотОбъект.Дата;
        Движение.Лекарство = СтрокаПартии.Лекарство;
        Движение.Партия = ЭтотОбъект.Ссылка;
        Движение.Количество = СтрокаПартии.КоличествоНачальное;
        Движение.ДатаПоступления = ЭтотОбъект.Дата;
        Движение.СрокГодности = СтрокаПартии.СрокГодности;
    КонецЦикла;

    Движения.ОстаткиНаСкладе.Записать();
КонецПроцедуры