
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиНаСкладе Приход
	Движения.ОстаткиНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаПозицииЛекарств Из ПозицииЛекарств Цикл
		Движение = Движения.ОстаткиНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Лекарство = ТекСтрокаПозицииЛекарств.Лекарство;
		Движение.Количество = ТекСтрокаПозицииЛекарств.Количество;
	КонецЦикла;

КонецПроцедуры

 Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
УникальныеЗаписи = Новый Соответствие();
Для Каждого ТекСтрока Из ПозицииЛекарств Цикл
		Если УникальныеЗаписи.Получить(ТекСтрока.Лекарство) <> Неопределено Тогда
		Отказ = Истина;
		Сообщить("Лекарство '" + ТекСтрока.Лекарство + "' уже существует в документе.");
	Прервать;
	КонецЕсли;
		УникальныеЗаписи.Вставить(ТекСтрока.Лекарство, Истина);
	КонецЦикла;


	Если ЭтотОбъект.ПозицииЛекарств.Количество() = 0 Тогда
	Отказ = Истина;
	Сообщить("Запись не может быть пустой.");
Возврат;
КонецЕсли;
КонецПроцедуры