
&НаКлиенте
Процедура ПозицииЛекарствЛекарствоПриИзменении(Элемент)
	
	ТекущиеДанныеСтрока = Элементы.ПозицииЛекарств.ТекущиеДанные;
	
	цена =ВернутьЦенуЛекарства(ТекущиеДанныеСтрока.Лекарство, Объект.Дата); 
	ТекущиеДанныеСтрока.Цена = цена;
КонецПроцедуры    



&НаСервере
функция ВернутьЦенуЛекарства(Лекарство, Дата)
         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНаЛекарстваСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНаЛекарства.СрезПоследних(&Дата, Лекарство = &Лекарство) КАК ЦеныНаЛекарстваСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Лекарство", Лекарство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		цена = ВыборкаДетальныеЗаписи.Цена;	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат цена;
КонецФункции

&НаКлиенте
Процедура ПозицииЛекарствКоличествоПриИзменении(Элемент)
	ТекущиеДанныеСтрока = Элементы.ПозицииЛекарств.ТекущиеДанные;
	
    ТекущиеДанныеСтрока.Сумма = ТекущиеДанныеСтрока.Цена * ТекущиеДанныеСтрока.Количество;
КонецПроцедуры
