&НаСервере
Функция ПолучитьФИОПользователя(ЛогинПользователя) Экспорт
    Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ЛогинПользователя);
    Если Пользователь <> Неопределено Тогда
        Возврат Пользователь.ПолноеИмя;
    Иначе
        Возврат "";
    КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Вызов серверной функции для получения ФИО пользователя
    ФИОПользователя = ПолучитьФИОПользователя(Объект.Код_Аптеки);
    
    // Подстановка ФИО пользователя в реквизит ФИО_фармацевт, если он существует
    Если ФИОПользователя <> "" Тогда
        Объект.ФИО_фармацевт = ФИОПользователя;
	КонецЕсли;                                   
	
КонецПроцедуры