
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	// регистр ОстаткиНаСкладе Расход
	Движения.ОстаткиНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаПозицииЛекарств Из ПозицииЛекарств Цикл
		Движение = Движения.ОстаткиНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Лекарство = ТекСтрокаПозицииЛекарств.Лекарство;
		Движение.Количество = ТекСтрокаПозицииЛекарств.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры      

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем ссылку на документ "СозданиеЗаявки"
    Заявка = ЭтотОбъект.Заявка;
    // Заполняем табличную часть "ПозицииЛекарств" данными из документа "СозданиеЗаявки"
    Для Каждого СтрокаЗаявки Из Заявка.ПозицииЛекарств Цикл
        НоваяСтрока = ЭтотОбъект.ПозицииЛекарств.Добавить();
        НоваяСтрока.Лекарство = СтрокаЗаявки.Лекарство;
        НоваяСтрока.Цена = СтрокаЗаявки.Цена;
        НоваяСтрока.Количество = СтрокаЗаявки.Количество;
        НоваяСтрока.Сумма = СтрокаЗаявки.Сумма;
    КонецЦикла;
КонецПроцедуры
