&НаСервере
Функция ПолучитьКодАптеки()
    ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
    
    // Получаем логин пользователя
    ЛогинПользователя = Строка(ТекущийПользователь.Имя);
    
    Если ЛогинПользователя = "Провизор" или ЛогинПользователя = "Админ" Тогда
        Возврат ""; // Возвращаем пустую строку, чтобы не применять фильтр
    Иначе
        Возврат ЛогинПользователя; // Возвращаем код аптеки для фильтрации
    КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    КодАптеки = ПолучитьКодАптеки();
    
    Если Не ПустаяСтрока(КодАптеки) Тогда
        ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Аптека.Код_Аптеки");
        ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
        ЭлементОтбора.ПравоеЗначение = КодАптеки;
        ЭлементОтбора.Использование = Истина;
    КонецЕсли;
КонецПроцедуры